# enter_info = input('Enter yes или no: ')
# if enter_info == 'yes':
#     print('ураа, благодаря вам у меня получилось!')
# elif enter_info == 'no':
#     print('буду исправлять код! ')
# else:
#     print('ошибка напишите: yes или no ')

# полиморфизм
# разное поведение одного и того же метода в разных классах

# какой функцией посмотреть все свойства в классе
# Функция dir в Python возвращает список имен атрибутов объекта. Однако, функция dir возвращает все атрибуты, включая служебные методы класса, что может быть избыточно. Но с ее помощью можно получить список всех атрибутов объекта, а затем получить их значения

# магические методы
# в Python начинаются и заканчиваются двойным подчеркиванием. Они позволяют нам определить специальное поведение для объектов

# экземпляр класса
# Объект — это экземпляр класса. Класс можно сравнить с чертежом, по которому создаются объекты. Python соответствует принципам объектно-ориентированного программирования. В python всё является объектами - и строки, и списки, и словари, и всё остальное.

# чем отличаются уровни доступа protected и private
# Private — объявляет метод или свойство доступным только в том классе в котором он присутствует. Тоесть к private методам и свойствам мы не можем обращаться ни из объектов, ни из дочерних классов. Protected — объявляет метод или свойство защищенными


# что из определений ошибочно
# на основе одного класса можно создать только один обьект (экземпляр)

